<?php

namespace Database\Seeders;

use App\Models\Award;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\Schema;

class AwardSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Schema::disableForeignKeyConstraints();
        Award::truncate();
        Schema::enableForeignKeyConstraints();
$columns = ['id', 'name', 'award_type_id'];
$items = [
[1, 'အဂ္ဂမဟာသီရိသုဓမ္မဘွဲ့','1'],
[2, 'သတိုးသီရိသုဓမ္မဘွဲ့','1'],
[3, 'မဟာသီရိသုဓမ္မဘွဲ့','1'],
[4, 'အဂ္ဂမဟာသရေစည်သူဘွဲ့','2'],
[5, 'သတိုးမဟာသရေစည်သူဘွဲ့','2'],
[6, 'မဟာသရေစည်သူဘွဲ့','2'],
[7, 'သရေစည်သူဘွဲ့','2'],
[8, 'စည်သူဘွဲ့','2'],
[9, 'အောင်ဆန်းတံဆိပ်','3'],
[10, 'သီဟဗလတံဆိပ်','3'],
[11, 'သူရဲကောင်းမှတ်တမ်းဝင်တံဆိပ်','3'],
[12, 'မြန်မာနိုင်ငံစစ်မှုထမ်းသင်္ဂတံဆိပ်','3'],
[13, 'စစ်မှုထမ်းကောင်းတံဆိပ်','3'],
[14, 'ပြည်သူ့သားကောင်းတံဆိပ်','3'],
[15, 'နိုင်ငံတော်စစ်မှုထမ်းတံဆိပ်','3'],
[16, 'ပြည်ပရန်နှိမ်တံဆိပ်','3'],
[17, 'ပြည်သူ့စစ်တိုက်ပွဲဝင်တံဆိပ်','3'],
[18, 'ရဲသီဟတံဆိပ်','4'],
[19, 'ရဲသူရတံဆိပ်','4'],
[20, 'ရဲဗလတံဆိပ်','4'],
[21, 'ရဲသူရိန်တံဆိပ်','4'],
[22, 'ရဲကျော်စွာတံဆိပ်','4'],
[23, 'ရဲကျော်သူတံဆိပ်','4'],
[24, 'ရဲမှုထမ်းကောင်းတံဆိပ်','4'],
[25, 'မြန်မာနိုင်ငံရဲပူးတွဲတိုက်ပွဲဝင်တံဆိပ်','4'],
[26, 'ပြည်သူ့ဝန်ထမ်းကောင်းတံဆိပ်','5'],
[27, 'ပြည်သူ့ဝန်ထမ်းတံဆိပ်','5'],
[28, 'ငြိမ်ဝပ်ပိပြားရေးနှင့် တရားဥပဒေစိုးမိုးရေးတံဆိပ်','5'],
[29, 'နိုင်ငံတော်အေးချမ်းသာယာရေးတံဆိပ်','5'],
[30, 'စီမံထူးချွန်တံဆိပ်(ပထမဆင့်)','5'],
[31, 'စီမံထူးချွန်တံဆိပ်(ဒုတိယဆင့်)','5'],
[32, 'စီမံထူးချွန်တံဆိပ်(တတိယဆင့်)','5'],
[33, 'လူမှုထူးချွန်တံဆိပ်(ပထမဆင့်)','5'],
[34, 'လူမှုထူးချွန်တံဆိပ်(ဒုတိယဆင့်)','5'],
[35, 'လူမှုထူးချွန်တံဆိပ်(တတိယဆင့်)','5'],
[36, 'လယ်ယာစီးပွားထူးချွန်တံဆိပ်(ပထမဆင့်)','6'],
[37, 'လယ်ယာစီးပွားထူးချွန်တံဆိပ်(ဒုတိယဆင့်)','6'],
[38, 'လယ်ယာစီးပွားထူးချွန်တံဆိပ်(တတိယဆင့်)','6'],
[39, 'စက်မှုစီးပွားထူးချွန်တံဆိပ်(ပထမဆင့်)','6'],
[40, 'စက်မှုစီးပွားထူးချွန်တံဆိပ်(ဒုတိယဆင့်)','6'],
[41, 'စက်မှုစီးပွားထူးချွန်တံဆိပ်(တတိယဆင့်)','6'],
[42, 'ကုန်သွယ်စီးပွားထူးချွန်တံဆိပ်(ပထမဆင့်)','6'],
[43, 'ကုန်သွယ်စီးပွားထူးချွန်တံဆိပ်(ဒုတိယဆင့်)','6'],
[44, 'ကုန်သွယ်စီးပွားထူးချွန်တံဆိပ်(တတိယဆင့်)','6'],
[45, 'ဝန်ဆောင်စီးပွားထူးချွန်တံဆိပ်(ပထမဆင့်)','6'],
[46, 'ဝန်ဆောင်စီးပွားထူးချွန်တံဆိပ်(ဒုတိယဆင့်)','6'],
[47, 'ဝန်ဆောင်စီးပွားထူးချွန်တံဆိပ်(တတိယဆင့်)','6'],
[48, 'သိပ္ပံပညာထူးချွန်တံဆိပ်(ပထမဆင့်)','7'],
[49, 'သိပ္ပံပညာထူးချွန်တံဆိပ်(ဒုတိယဆင့်)','7'],
[50, 'သိပ္ပံပညာထူးချွန်တံဆိပ်(တတိယဆင့်)','7'],
[51, 'ဝိဇ္ဇာပညာထူးချွန်တံဆိပ်(ပထမဆင့်)','7'],
[52, 'ဝိဇ္ဇာပညာထူးချွန်တံဆိပ်(ဒုတိယဆင့်)','7'],
[53, 'ဝိဇ္ဇာပညာထူးချွန်တံဆိပ်(တတိယဆင့်)','7'],
[54, 'ဆေးပညာထူးချွန်တံဆိပ်(ပထမဆင့်)','7'],
[55, 'ဆေးပညာထူးချွန်တံဆိပ်(ဒုတိယဆင့်)','7'],
[56, 'ဆေးပညာထူးချွန်တံဆိပ်(တတိယဆင့်)','7'],
[57, 'နည်းပညာထူးချွန်တံဆိပ်(ပထမဆင့်)','7'],
[58, 'နည်းပညာထူးချွန်တံဆိပ်(ဒုတိယဆင့်)','7'],
[59, 'နည်းပညာထူးချွန်တံဆိပ်(တတိယဆင့်)','7'],
[60, 'အနုပညာထူးချွန်တံဆိပ်(ပထမဆင့်)','7'],
[61, 'အနုပညာထူးချွန်တံဆိပ်(ဒုတိယဆင့်)','7'],
[62, 'အနုပညာထူးချွန်တံဆိပ်(တတိယဆင့်)','7'],
[63, 'စာပေပညာထူးချွန်တံဆိပ်(ပထမဆင့်)','7'],
[64, 'စာပေပညာထူးချွန်တံဆိပ်(ဒုတိယဆင့်)','7'],
[65, 'စာပေပညာထူးချွန်တံဆိပ်(တတိယဆင့်)','7'],
];
foreach($items as $item){
    Award::create(array_combine($columns,$item));
}
    }
}
