<?php

namespace Database\Seeders;
use App\Models\Division;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\Schema;

class DivisionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Schema::disableForeignKeyConstraints();
        Division::truncate();
        Schema::enableForeignKeyConstraints();

        $columns = ['id', 'name'];
        $items = [
            [1, 'ရင်းနှီးမြှုပ်နှံမှုဌာနခွဲ-၁'],
            [2, 'ရင်းနှီးမြှုပ်နှံမှုဌာနခွဲ-၂'],
            [3, 'ရင်းနှီးမြှုပ်နှံမှုဌာနခွဲ-၃'],
            [4, 'ရင်းနှီးမြှုပ်နှံမှုဌာနခွဲ-၄'],
            [5, 'ရင်းနှီးမြှုပ်နှံမှုလုပ်ငန်းများကြီးကြပ်ရေးဌာနခွဲ'],
            [6, 'စီမံကိန်းနှင့် စာရင်းအင်းဌာနခွဲ'],
            [7, 'ရင်းနှီးမြှုပ်နှံမှုမြှင့်တင်ရေးဌာနခွဲ'],
            [8, 'မူဝါဒနှင့်ဥပဒေဌာနခွဲ'],
            [9, 'ကုမ္ပဏီရေးရာဌာနခွဲ'],
            [10, 'လူ့စွမ်းအားအရင်းအမြစ်ဖွံ့ဖြိုးရေးနှင့် သုတေသနဌာနခွဲ'],
            [11, 'စီမံရေးနှင့် ငွေစာရင်းဌာနခွဲ'],
            [12, 'ကချင်ပြည်နယ်ဦးစီးမှူးရုံး'],
            [13, 'ကယားပြည်နယ်ဦးစီးမှူးရုံး'],
            [14, 'ကရင်ပြည်နယ်ဦးစီးမှူးရုံး'],
            [15, 'ချင်းပြည်နယ်ဦးစီးမှူးရုံး'],
            [16, 'စစ်ကိုင်းတိုင်းဒေသကြီးဦးစီးမှူးရုံး'],
            [17, 'တနင်္သာရီတိုင်းဒေသကြီးဦးစီးမှူးရုံး'],
            [18, 'ပဲခူးတိုင်းဒေသကြီးဦးစီးမှူးရုံး'],
            [19, 'မကွေးတိုင်းဒေသကြီးဦးစီးမှူးရုံး'],
            [20, 'မန္တလေးတိုင်းဒေသကြီးဦးစီးမှူးရုံး'],
            [21, 'မွန်ပြည်နယ်ဦးစီးမှူးရုံး'],
            [22, 'ရခိုင်ပြည်နယ်ဦးစီးမှူးရုံး'],
            [23, 'ရန်ကုန်တိုင်းဒေသကြီးဦးစီးမှူးရုံး'],
            [24, 'ရှမ်းပြည်နယ်ဦးစီးမှူးရုံး'],
            [25, 'ဧရာဝတီတိုင်းဒေသကြီးဦးစီးမှူးရုံး'],
            [26, 'နေပြည်တော်တိုင်းဒေသကြီးဦးစီးမှူးရုံး']
        ];

        foreach ($items as $item) {
            Division::create(array_combine($columns, $item));
        }
    }
}
