<?php

namespace Database\Seeders;
use App\Models\Division;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\Schema;

class DivisionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Schema::disableForeignKeyConstraints();
        Division::truncate();
        Schema::enableForeignKeyConstraints();

        $columns = ['id', 'name', 'nick_name', 'division_type_id'];
        $items = [
            [1, 'ရင်းနှီးမြှုပ်နှံမှုဌာနခွဲ-၁', 'ရင်း-၁', 1],
            [2, 'ရင်းနှီးမြှုပ်နှံမှုဌာနခွဲ-၂', 'ရင်း-၂', 1],
            [3, 'ရင်းနှီးမြှုပ်နှံမှုဌာနခွဲ-၃', 'ရင်း-၃', 1],
            [4, 'ရင်းနှီးမြှုပ်နှံမှုဌာနခွဲ-၄', 'ရင်း-၄', 1],
            [5, 'ရင်းနှီးမြှုပ်နှံမှုလုပ်ငန်းများကြီးကြပ်ရေးဌာနခွဲ', 'ရင်းနှီးကြီးကြပ်', 1],
            [6, 'စီမံကိန်းနှင့် စာရင်းအင်းဌာနခွဲ', 'စီမံကိန်း', 1],
            [7, 'ရင်းနှီးမြှုပ်နှံမှုမြှင့်တင်ရေးဌာနခွဲ', 'ရင်းနှီးမြှင့်တင်', 1],
            [8, 'မူဝါဒနှင့်ဥပဒေဌာနခွဲ', 'မူဝါဒ', 1],
            [9, 'ကုမ္ပဏီရေးရာဌာနခွဲ', 'ကုမ္ပဏီ', 1],
            [10, 'လူ့စွမ်းအားအရင်းအမြစ်ဖွံ့ဖြိုးရေးနှင့် သုတေသနဌာနခွဲ', 'HR', 1],
            [11, 'စီမံရေးနှင့် ငွေစာရင်းဌာနခွဲ', 'စီမံ', 1],
            [12, 'ကချင်ပြည်နယ်ဦးစီးမှူးရုံး', 'ကချင်', 2],
            [13, 'ကယားပြည်နယ်ဦးစီးမှူးရုံး', 'ကယား', 2],
            [14, 'ကရင်ပြည်နယ်ဦးစီးမှူးရုံး', 'ကရင်', 2],
            [15, 'ချင်းပြည်နယ်ဦးစီးမှူးရုံး', 'ချင်း', 2],
            [16, 'စစ်ကိုင်းတိုင်းဒေသကြီးဦးစီးမှူးရုံး', 'စစ်ကိုင်း', 2],
            [17, 'တနင်္သာရီတိုင်းဒေသကြီးဦးစီးမှူးရုံး', 'တနင်္သာရီ', 2],
            [18, 'ပဲခူးတိုင်းဒေသကြီးဦးစီးမှူးရုံး', 'ပဲခူး', 2],
            [19, 'မကွေးတိုင်းဒေသကြီးဦးစီးမှူးရုံး', 'မကွေး', 2],
            [20, 'မန္တလေးတိုင်းဒေသကြီးဦးစီးမှူးရုံး', 'မန္တလေး', 2],
            [21, 'မွန်ပြည်နယ်ဦးစီးမှူးရုံး', 'မွန်', 2],
            [22, 'ရခိုင်ပြည်နယ်ဦးစီးမှူးရုံး', 'ရခိုင်', 2],
            [23, 'ရန်ကုန်တိုင်းဒေသကြီးဦးစီးမှူးရုံး', 'ရန်ကုန်', 2],
            [24, 'ရှမ်းပြည်နယ်ဦးစီးမှူးရုံး', 'ရှမ်း', 2],
            [25, 'ဧရာဝတီတိုင်းဒေသကြီးဦးစီးမှူးရုံး', 'ဧရာဝတီ', 2],
            [26, 'နေပြည်တော်တိုင်းဒေသကြီးဦးစီးမှူးရုံး', 'နေပြည်တော်', 2]
        ];

        foreach ($items as $item) {
            Division::create(array_combine($columns, $item));
        }
    }
}
