<?php

namespace Database\Seeders;
use App\Models\Division;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\Schema;

class DivisionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Schema::disableForeignKeyConstraints();
        Division::truncate();
        Schema::enableForeignKeyConstraints();

        $columns = ['id', 'name', 'nick_name', 'division_type_id','sort_no'];
        $items = [
            [1, 'ရင်းနှီးမြှုပ်နှံမှုဌာနခွဲ-၁', 'ရင်း-၁', 1,1],
            [2, 'ရင်းနှီးမြှုပ်နှံမှုဌာနခွဲ-၂', 'ရင်း-၂', 1,2],
            [3, 'ရင်းနှီးမြှုပ်နှံမှုဌာနခွဲ-၃', 'ရင်း-၃', 1,3],
            [4, 'ရင်းနှီးမြှုပ်နှံမှုဌာနခွဲ-၄', 'ရင်း-၄', 1,4],
            [5, 'ရင်းနှီးမြှုပ်နှံမှုလုပ်ငန်းများကြီးကြပ်ရေးဌာနခွဲ', 'ရင်းနှီးကြီးကြပ်', 1,5],
            [6, 'စီမံကိန်းနှင့် စာရင်းအင်းဌာနခွဲ', 'စီမံကိန်း', 1,6],
            [7, 'ရင်းနှီးမြှုပ်နှံမှုမြှင့်တင်ရေးဌာနခွဲ', 'ရင်းနှီးမြှင့်တင်', 1,7],
            [8, 'မူဝါဒနှင့်ဥပဒေဌာနခွဲ', 'မူဝါဒ', 1,8],
            [9, 'ကုမ္ပဏီရေးရာဌာနခွဲ', 'ကုမ္ပဏီ', 1,9],
            [10, 'လူ့စွမ်းအားအရင်းအမြစ်ဖွံ့ဖြိုးရေးနှင့် သုတေသနဌာနခွဲ', 'HR', 1,10],
            [11, 'စီမံရေးနှင့် ငွေစာရင်းဌာနခွဲ', 'စီမံ', 1,11],
            [12, 'ကချင်ပြည်နယ်ညွှန်ကြားရေးမှုးရုံး', 'ကချင်', 2,12],
            [13, 'ကယားပြည်နယ်ညွှန်ကြားရေးမှုးရုံး', 'ကယား', 2,13],
            [14, 'ကရင်ပြည်နယ်ညွှန်ကြားရေးမှုးရုံး', 'ကရင်', 2,14],
            [15, 'ချင်းပြည်နယ်ညွှန်ကြားရေးမှုးရုံး', 'ချင်း', 2,15],
            [16, 'စစ်ကိုင်းတိုင်းဒေသကြီးညွှန်ကြားရေးမှုးရုံး', 'စစ်ကိုင်း', 2,16],
            [17, 'တနင်္သာရီတိုင်းဒေသကြီးညွှန်ကြားရေးမှုးရုံး', 'တနင်္သာရီ', 2,17],
            [18, 'ပဲခူးတိုင်းဒေသကြီးညွှန်ကြားရေးမှုးရုံး', 'ပဲခူး', 2,18],
            [19, 'မကွေးတိုင်းဒေသကြီးညွှန်ကြားရေးမှုးရုံး', 'မကွေး', 2,19],
            [20, 'မန္တလေးတိုင်းဒေသကြီးညွှန်ကြားရေးမှုးရုံး', 'မန္တလေး', 2,20],
            [21, 'မွန်ပြည်နယ်ညွှန်ကြားရေးမှုးရုံး', 'မွန်', 2,21],
            [22, 'ရခိုင်ပြည်နယ်ညွှန်ကြားရေးမှုးရုံး', 'ရခိုင်', 2,22],
            [23, 'ရန်ကုန်တိုင်းဒေသကြီးညွှန်ကြားရေးမှုးရုံး', 'ရန်ကုန်', 2,23],
            [24, 'ရှမ်းပြည်နယ်ညွှန်ကြားရေးမှုးရုံး', 'ရှမ်း', 2,24],
            [25, 'ဧရာဝတီတိုင်းဒေသကြီးညွှန်ကြားရေးမှုးရုံး', 'ဧရာဝတီ', 2,25],
            [26, 'နေပြည်တော်တိုင်းဒေသကြီးညွှန်ကြားရေးမှုးရုံး', 'နေပြည်တော်', 2,26]
        ];

        foreach ($items as $item) {
            Division::create(array_combine($columns, $item));
        }
    }
}


// [1, 'စီမံရေးနှင့် ငွေစာရင်းဌာနခွဲ', 'စီမံ', 1,1],
// [2, 'ရင်းနှီးမြှုပ်နှံမှုဌာနခွဲ-၁', 'ရင်း-၁', 1,2],
// [3, 'ရင်းနှီးမြှုပ်နှံမှုဌာနခွဲ-၂', 'ရင်း-၂', 1,3],
// [4, 'ရင်းနှီးမြှုပ်နှံမှုဌာနခွဲ-၃', 'ရင်း-၃', 1,4],
// [5, 'ရင်းနှီးမြှုပ်နှံမှုဌာနခွဲ-၄', 'ရင်း-၄', 1,5],
// [6, 'မူဝါဒနှင့်ဥပဒေဌာနခွဲ', 'မူဝါဒ', 1,6],
// [7, 'ရင်းနှီးမြှုပ်နှံမှုမြှင့်တင်ရေးဌာနခွဲ', 'ရင်းနှီးမြှင့်တင်', 1,7],

// [8, 'ရင်းနှီးမြှုပ်နှံမှုလုပ်ငန်းများကြီးကြပ်ရေးဌာနခွဲ', 'ရင်းနှီးကြီးကြပ်', 1,8],
// [9, 'စီမံကိန်းနှင့် စာရင်းအင်းဌာနခွဲ', 'စီမံကိန်း', 1,9],
// [10, 'ကုမ္ပဏီရေးရာဌာနခွဲ', 'ကုမ္ပဏီ', 1,10],
// [11, 'လူ့စွမ်းအားအရင်းအမြစ်ဖွံ့ဖြိုးရေးနှင့် သုတေသနဌာနခွဲ', 'HR', 1,11],


// [12, 'ရန်ကုန်တိုင်းဒေသကြီးညွှန်ကြားရေးမှုးရုံး', 'ရန်ကုန်', 2,12],
// [13, 'နေပြည်တော်တိုင်းဒေသကြီးညွှန်ကြားရေးမှုးရုံး', 'နေပြည်တော်', 2,13],
// [14, 'မန္တလေးတိုင်းဒေသကြီးညွှန်ကြားရေးမှုးရုံး', 'မန္တလေး', 2,14],
// [15, 'ရှမ်းပြည်နယ်ညွှန်ကြားရေးမှုးရုံး', 'ရှမ်း', 2,15],
// [16, 'မွန်ပြည်နယ်ညွှန်ကြားရေးမှုးရုံး', 'မွန်', 2,16],
// [17, 'ဧရာဝတီတိုင်းဒေသကြီးညွှန်ကြားရေးမှုးရုံး', 'ဧရာဝတီ', 2,17],
// [18, 'စစ်ကိုင်းတိုင်းဒေသကြီးညွှန်ကြားရေးမှုးရုံး', 'စစ်ကိုင်း', 2,18],

// [19, 'တနင်္သာရီတိုင်းဒေသကြီးညွှန်ကြားရေးမှုးရုံး', 'တနင်္သာရီ', 2,17],
// [20, 'ကရင်ပြည်နယ်ညွှန်ကြားရေးမှုးရုံး', 'ကရင်', 2,14],
// [21, 'ပဲခူးတိုင်းဒေသကြီးညွှန်ကြားရေးမှုးရုံး', 'ပဲခူး', 2,18],
// [22, 'မကွေးတိုင်းဒေသကြီးညွှန်ကြားရေးမှုးရုံး', 'မကွေး', 2,19],
// [23, 'ကယားပြည်နယ်ညွှန်ကြားရေးမှုးရုံး', 'ကယား', 2,13],

// [24, 'ကချင်ပြည်နယ်ညွှန်ကြားရေးမှုးရုံး', 'ကချင်', 2,12],
// [25, 'ရခိုင်ပြည်နယ်ညွှန်ကြားရေးမှုးရုံး', 'ရခိုင်', 2,22],

// [26, 'ချင်းပြည်နယ်ညွှန်ကြားရေးမှုးရုံး', 'ချင်း', 2,15],
// ];