<?php

namespace Database\Seeders;

use App\Models\Ministry;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\Schema;

class MinistrySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Schema::disableForeignKeyConstraints();
        Ministry::truncate();
        Schema::enableForeignKeyConstraints();
        $columns = ['id', 'name'];
        $items = [
            [1,'နိုင်ငံတော်စီမံအုပ်ချုပ်ရေးကောင်စီရုံး' ],
            [2,'ပြည်ထောင်စုအစိုးရအဖွဲ့ရုံး' ],
            [3,'ပြည်ထောင်စုလွှတ်တော်ရုံး'],
            [4,'ပြည်သူ့လွှတ်တော်ရုံး' ],
            [5,'အမျိုးသားလွှတ်တော်ရုံး' ],
            [6,'ပြည်ထောင်စုတရားလွှတ်တော်ချုပ်' ],
            [7,'နိုင်ငံတော်ဖွဲ့စည်းပုံအခြေခံဥပဒေဆိုင်ရာခုံရုံး'],
            [8,'ပြည်ထောင်စုရွေးကောက်ပွဲကော်မရှင်ရုံး' ],
            [9,'ပို့ဆောင်ရေးနှင့်ဆက်သွယ်ရေးဝန်ကြီးဌာန'],
            [10,'ကာကွယ်ရေးဝန်ကြီးဌာန'],
            [11,'ပြည်ထဲရေးဝန်ကြီးဌာန' ],
            [12,'စီမံကိန်းနှင့်ဘဏ္ဍာရေးဝန်ကြီးဌာန' ] , 
            [13,'နိုင်ငံခြားရေးဝန်ကြီးဌာန' ] ,
            [14,'နယ်စပ်ရေးရာဝန်ကြီးဌာန' ] ,
            [15,'ရင်းနှီးမြှုပ်နှံမှုနှင့်နိုင်ငံခြားစီးပွားဆက်သွယ်ရေးဝန်ကြီးဌာန' ] ,
            [16,'ဥပဒေရေးရာဝန်ကြီးဌာန' ] ,
            [17,'အပြည်ပြည်ဆိုင်ရာပူးပေါင်းဆောင်ရွက်ရေးဝန်ကြီးဌာန' ] ,
            [18,'ပြန်ကြားရေးဝန်ကြီးဌာန' ] ,
            [19,'သာသနာရေးနှင့် ယဉ်ကျေးမှုဝန်ကြီးဌာန' ] ,
            [20,'စိုက်ပျိုးရေး၊ မွေးမြူရေးနှင့်ဆည်မြောင်းဝန်ကြီးဌာန' ] ,
            [21,'သမဝါယမနှင့်ကျေးလက်ဖွံ့ဖြိုးရေးဝန်ကြီးဌာန' ] ,
            [22,'သယံဇာတနှင့်သဘာဝပတ်ဝန်းကျင်ထိန်းသိမ်းရေးဝန်ကြီးဌာန' ] ,
            [23,'လျှပ်စစ်စွမ်းအားဝန်ကြီးဌာန' ] ,
            [24,'စွမ်းအင်ဝန်ကြီးဌာန' ] ,
            [25,'စက်မှုဝန်ကြီးဌာန' ] ,
            [26,'လူဝင်မှုကြီးကြပ်ရေးနှင့်ပြည်သူ့အင်အားဝန်ကြီးဌာန' ] ,
            [27,'အလုပ်သမားဝန်ကြီးဌာန' ] ,
            [28,'စီးပွားရေးနှင့်ကူးသန်းရောင်းဝယ်ရေးဝန်ကြီးဌာန' ] ,
            [29,'ပညာရေးဝန်ကြီးဌာန' ] ,
            [30,'သိပ္ပံနှင့်နည်းပညာဝန်ကြီးဌာန' ] ,
            [31,'ကျန်းမာရေးဝန်ကြီးဌာန' ] ,
            [32,'အားကစားနှင့်လူငယ်ရေးရာဝန်ကြီးဌာန' ] ,
            [33,'ဆောက်လုပ်ရေးဝန်ကြီးဌာန' ] ,
            [34,'လူမှုဝန်ထမ်းကယ်ဆယ်ရေးနှင့်ပြန်လည်နေရာချထားရေးဝန်ကြီးဌာန' ] ,
            [35,'ဟိုတယ်နှင့်ခရီးသွားလာရေးဝန်ကြီးဌာန' ] ,
            [36,'တိုင်းရင်းသားလူမျိုးများရေးရာဝန်ကြီးဌာန' ] ,
            [37,'ပြည်ထောင်စုစာရင်းစစ်ချုပ်ရုံး' ] ,
            [38,'ပြည်ထောင်စုရာထူးဝန်အဖွဲ့' ] ,
            [39,'နေပြည်တော်ကောင်စီ' ] ,
            [40,'ကချင်ပြည်နယ်အစိုးရအဖွဲ့' ] ,
            [41,'ကယားပြည်နယ်အစိုးရအဖွဲ့' ] ,
            [42,'ကရင်ပြည်နယ်အစိုးရအဖွဲ့' ] ,
            [43,'ချင်းပြည်နယ်အစိုးရအဖွဲ့' ] ,
            [44,'စစ်ကိုင်းတိုင်းဒေသကြီးအစိုးရအဖွဲ့' ] ,
            [45,'တနင်္သာရီတိုင်းဒေသကြီးအစိုးရအဖွဲ့' ] ,
            [46,'ပဲခူးတိုင်းဒေသကြီးအစိုးရအဖွဲ့' ] ,
            [47,'မကွေးတိုင်းဒေသကြီးအစိုးရအဖွဲ့' ] ,
            [48,'မန္တလေးတိုင်းဒေသကြီးအစိုးရအဖွဲ့' ] ,
            [49,'မွန်ပြည်နယ်အစိုးရအဖွဲ့' ] ,
            [50,'ရခိုင်ပြည်နယ်အစိုးရအဖွဲ့' ] ,
            [51,'ရန်ကုန်တိုင်းဒေသကြီးအစိုးရအဖွဲ့' ] ,
            [52,'ရှမ်းပြည်နယ်အစိုးရအဖွဲ့' ] ,
            [53,'ဧရာဝတီတိုင်းဒေသကြီးအစိုးရအဖွဲ့' ] ,
            [54,'မြန်မာနိုင်ငံတော်ဗဟိုဘဏ်' ] ,
            [55,'အဂတိလိုက်စားမှုတိုက်ဖျက်ရေးကော်မရှင်ရုံး' ] ,
            [56,'နေပြည်တော်စည်ပင်သာယာရေးကော်မတီ' ] ,
            [57,'ရန်ကုန်မြို့တော်စည်ပင်သာယာရေးကော်မတီ' ] ,
            [58,'မန္တလေးမြို့တော်စည်ပင်သာယာရေးကော်မတီ' ] ,
        ];
        foreach ($items as $item) {
            Ministry::create(array_combine($columns, $item));
        }
    }
}
