<?php

namespace Database\Seeders;

use App\Models\Payscale;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\Schema;

class PayscaleSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Schema::disableForeignKeyConstraints();
        Payscale::truncate();
        Schema::enableForeignKeyConstraints();

        $columns = ['id', 'name', 'min_salary', 'increment', 'max_salary', 'staff_type_id', 'allowed_qty', 'similiar_rank'];
        
        
        $items = [
            [1, '၅၅၀၀၀၀', '550000', '0', '550000', '1', '1', 'ညွှန်ကြားရေးမှုးချုပ် / ဦးဆောင်ညွှန်ကြားရေးမှုးနှင့်အဆင့်တူ'],
            [2, '၄၁၈၀၀၀-၄၀၀၀-၄၃၈၀၀၀',  '418000', '40000', '438000', '1', '4', 'ဒုတိယညွှန်ကြားရေးမှုးချုပ်နှင့် အဆင့်တူ'],
            [3, '၃၇၄၀၀၀-၄၀၀၀-၃၉၄၀၀၀',  '374000', '40000', '394000', '1', '26', 'ညွှန်ကြားရေးမှုးနှင့်အဆင့်တူ'],
            [4, '၃၄၁၀၀၀-၄၀၀၀-၃၆၁၀၀၀', '341000', '40000', '361000', '1', '68', 'ဒုတိယညွှန်ကြားရေးမှုးနှင့်အဆင့်တူ'],
            [5, '၃၀၈၀၀၀-၄၀၀၀-၃၂၈၀၀၀',  '308000', '40000', '328000', '1', '101', 'လက်ထောက်ညွှန်ကြားရေးမှုးနှင့်အဆင့်တူ'],
            [6, '၂၇၅၀၀၀-၄၀၀၀-၂၉၅၀၀၀',  '275000', '40000', '295000', '1', '175', 'ဦးစီးအရာရှိနှင့်အဆင့်တူ'],
            [7, '၂၃၄၀၀၀-၂၀၀၀-၂၄၄၀၀၀',  '234000', '2000', '244000', '2', '6', 'ရုံးအုပ်နှင့်အဆင့်တူ'],
            [8, '၂၁၆၀၀၀-၂၀၀၀-၂၂၆၀၀၀',  '216000', '2000', '226000', '2', '194', 'ဒုတိယဦးစီးမှုးနှင့်အဆင့်တူ'],
            [9, '၁၉၈၀၀၀-၂၀၀၀-၂၀၈၀၀၀', '198000', '2000', '208000', '2', '98', 'အကြီးတန်းစာရေးနှင့်အဆင့်တူ'],
            [10, '၁၈၀၀၀၀-၂၀၀၀-၁၉၀၀၀၀',  '180000', '2000', '190000', '2', '91', 'အငယ်တန်းစာရေးနှင့်အဆင့်တူ'],
            [11, '၁၆၂၀၀၀-၂၀၀၀-၁၇၂၀၀၀',  '162000', '2000', '172000', '2', '39', 'ရုံးအကူမှူးနှင့်အဆင့်တူ'],
            [12, '၁၄၄၀၀၀-၂၀၀၀-၁၅၄၀၀၀',  '144000', '2000', '154000', '2', '56', 'ရုံးအကူနှင့်အဆင့်တူ'] , 
            [13, '4800',  '4800', '0', '6800','3', '100', 'နေ့စား'] ,


        ];


        foreach ($items as $item) {
            Payscale::create(array_combine($columns, $item));
        }
    }
}
