<?php

namespace Database\Seeders;

use App\Models\Rank;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Facades\Schema;

class RankSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Schema::disableForeignKeyConstraints();
        Rank::truncate();
        Schema::enableForeignKeyConstraints();

        $columns = ['id', 'name', 'payscale_id', 'staff_type_id', 'allowed_qty','sort_no' , 'is_dica' ];
        $items = [
            [1,'ညွှန်ကြားရေးမှူးချုပ်', 1, 1, 1,1 , 1 ],
            [2,'ဒုတိယညွှန်ကြားရေးမှူးချုပ်', 2, 1, 4,2 , 1 ],
            [3,'ညွှန်ကြားရေးမှူး', 3, 1, 26,3 , 1 ],
            [4,'ဒုတိယညွှန်ကြားရေးမှူး', 4, 1, 68,4 , 1 ],
            [5,'လက်ထောက်ညွှန်ကြားရေးမှူး', 5, 1, 101,5 , 1 ],
            [6,'ဦးစီးအရာရှိ', 6, 1, 175,6 , 1 ],
            [7,'ရုံးအုပ်', 7, 2, 3,7 , 1 ],
            [8,'စာရင်းကိုင်(၁)', 7, 2, 3,8 , 1 ],
            [9,'ဒုတိယဦးစီးမှူး', 8, 2, 179,9 , 1 ],
            [10,'စာရင်းကိုင်(၂)', 8, 2, 8,10 , 1 ],
            [11,'ဌာနခွဲစာရေး', 8, 2, 7,11 , 1 ],
            [12,'အကြီးတန်းစာ‌ရေး', 9, 2, 86,13 , 1 ],
            [13,'စာရင်းကိုင်(၃)', 9, 2, 12,12 , 1 ],
            [14,'အငယ်တန်းစာရေး', 10, 2, 78,15 , 1 ],
            [15,'စာရင်းကိုင်(၄)', 10, 2, 12,14 , 1 ],
            [16,'ယာဉ်မောင်းစက်ပြင်(၄)', 10, 2, 1,16 , 1 ],
            [17,'ရုံးအကူမှူး', 11, 2, 2,19 , 1 ],
            [18,'စာကူးစက်လှည့်အကူ', 11, 2, 1,17 , 1 ],
            [19,'ယာဉ်မောင်း(၅)', 11, 2, 36,18 , 1 ],
            [20,'ရုံးအကူ', 12, 2, 37,20 , 1 ],
            [21,'သန့်ရှင်း‌ရေးအကူ', 12, 2, 17,21 , 1 ],
            [22,'အစောင့်', 12, 2, 2,22 , 1 ],
            [23,'နေ့စား', 13, 3,  100,23 , 1 ],
        ];

        foreach ($items as $item) {
            Rank::create(array_combine($columns, $item));
        }
    }
}



// [1,'ညွှန်ကြားရေးမှူးချုပ်', 1, 1, 1,1],
// [2,'ဒုတိယညွှန်ကြားရေးမှူးချုပ်', 2, 1, 4,2],
// [3,'ညွှန်ကြားရေးမှူး', 3, 1, 26,3],
// [4,'ဒုတိယညွှန်ကြားရေးမှူး', 4, 1, 68,4],
// [5,'လက်ထောက်ညွှန်ကြားရေးမှူး', 5, 1, 101,5],
// [6,'ဦးစီးအရာရှိ', 6, 1, 175,6],
// [7,'ရုံးအုပ်', 7, 2, 3,7],
// [8,'စာရင်းကိုင်(၁)', 7, 2, 3,8],
// [9,'ဒုတိယဦးစီးမှူး', 8, 2, 179,9],
// [10,'စာရင်းကိုင်(၂)', 8, 2, 8,10],
// [11,'ဌာနခွဲစာရေး', 8, 2, 7,11],
// [12,'စာရင်းကိုင်(၃)', 9, 2, 12,12],

// [12,'အကြီးတန်းစာ‌ရေး', 9, 2, 86,12],
// [14,'စာရင်းကိုင်(၄)', 10, 2, 12,14],

// [15,'အငယ်တန်းစာရေး', 10, 2, 78,15],
// [16,'ယာဉ်မောင်းစက်ပြင်(၄)', 10, 2, 1,16],
// [17,'စာကူးစက်လှည့်အကူ', 11, 2, 1,17],
// [18,'ယာဉ်မောင်း(၅)', 11, 2, 36,18],

// [19,'ရုံးအကူမှူး', 11, 2, 2,19],
// [20,'ရုံးအကူ', 12, 2, 37,20],
// [21,'သန့်ရှင်း‌ရေးအကူ', 12, 2, 17,21],
// [22,'အစောင့်', 12, 2, 2,22],
// [23,'နေ့စား', 13, 3,  100,23],