<?php

namespace Database\Seeders;

use App\Models\TrainingType;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\Schema;

class TrainingTypeSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Schema::disableForeignKeyConstraints();
        TrainingType::truncate();
        Schema::enableForeignKeyConstraints();
       

$columns = ['id', 'name'];
$items = [
[1, 'ဝန်ထမ်းအဖွဲ့အစည်းအကြီးအမှူးသင်တန်း'],
[2, 'အဆင့်မြင့်အရာထမ်းသင်တန်း'],
[3, 'အလယ်အလတ်အဆင့်အရာထမ်းသင်တန်း'],
[4, 'အရာထမ်းလောင်း(အထူး)သင်တန်း'],
[5, 'အရာထမ်းအခြေခံသင်တန်း'],
[6, 'အရာထမ်းငယ်သင်တန်း'],
[7, 'စာရေးဝန်ထမ်းကြီးကြပ်သင်တန်း'],
[8, 'စာရေးဝန်ထမ်းသင်တန်း'],
[9, 'အုပ်ချုပ်မှုစွမ်းရည်မြင့်မားရေးသင်တန်း'],
[10, 'ဝန်ထမ်းအဖွဲ့အစည်းအကြီးအမှူးစီမံခန့်ခွဲမှုသင်တန်း'],
[11, 'ဝန်ထမ်းအဖွဲ့အစည်းဒုတိယအကြီးအမှူးစီမံခန့်ခွဲမှုသင်တန်း'],
[12, 'အဆင့်မြင့်အရာထမ်းစီမံခန့်ခွဲမှုသင်တန်း'],
[13, 'အလယ်အလတ်အဆင့်အရာထမ်းစီမံခန့်ခွဲမှုသင်တန်း'],
[14, 'အလယ်အလတ်အဆင့်အရာထမ်းစီမံခန့်ခွဲမှုသင်တန်း၊ ပြည်သူ့ဝန်ထမ်းစီမံခန့်ခွဲမှုအဆင့်မြင့်ဒီပလိုမာသင်တန်း'],
[15, 'အကြိုဝန်ထမ်းလောင်းသင်တန်း'],
[16, 'အရာထမ်းလောင်းအခြေခံသင်တန်း'],
[17, 'အရာထမ်းလောင်းအခြေခံသင်တန်း၊ ပြည်သူ့ဝန်ထမ်းစီမံခန့်ခွဲမှုဘွဲ့လွန်ဒီပလိုမာသင်တန်း'],
[18, 'အထူးဝန်ထမ်းလောင်းသင်တန်း'],
[19, 'အရာထမ်းလောင်းအခြေခံ(အထူး)သင်တန်း'],
[20, 'အခြေခံပြည်သူ့ရေးရာဝန်ထမ်းလောင်းသင်တန်း'],
[21, 'အခြေခံဝန်ထမ်းလောင်း(အငယ်တန်း)သင်တန်း'],
[22, 'အရာထမ်းငယ်အခြေခံသင်တန်း'],
[23, 'ပြည်သူ့ရေးရာစာရေးဝန်ထမ်း(ကြီးကြပ်မှု)သင်တန်း'],
[24, 'စာရေးဝန်ထမ်း(ကြီးကြပ်မှု)သင်တန်း'],
[25, 'စာရေးဝန်ထမ်းကြီးကြပ်မှုတန်းမြင့်သင်တန်း'],
[26, 'အခြေခံပြည်သူ့ရေးရာစာရေးဝန်ထမ်းသင်တန်း'],
[27, 'အခြေခံစာရေးဝန်ထမ်းသင်တန်း'],
[28, 'စာရေးဝန်ထမ်းအခြေခံသင်တန်း'],
[29, 'ဌာနတွင်းဝန်ထမ်းစွမ်းဆောင်ရည်မြှင့်တင်ရေးသင်တန်း'],
[30, 'ဝန်ကြီးဌာနဝန်ထမ်းစွမ်းဆောင်ရည်မြှင့်တင်ရေးသင်တန်း'],
[31, 'နိုင်ငံတော်ကာကွယ်ရေးတက္ကသိုလ်'],
[32, 'အခြား'],
];
        
        foreach($items as $item){
            TrainingType::create(array_combine($columns,$item));
        }
    }
}
